Xavier1989/KW41Z/Host/framework/OSAbstraction/Source/fsl_os_abstraction_bm.c
            while (p_currentTaskControlBlock != p_taskListHead)
            {           
                if (p_newTaskControlBlock->priority <= p_currentTaskControlBlock->priority)
                {
                    OSA_InsertTaskBefore(p_newTaskControlBlock, p_currentTaskControlBlock);
                    break;
                }
                p_currentTaskControlBlock = p_currentTaskControlBlock->next;
            }        
            
        }     
        /* Task handler is pointer of task control block. */
        taskId = (osaTaskId_t)p_newTaskControlBlock;
    }
    
    return taskId;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TaskDestroy
 * Description   : This function destroy a task. 
 * Param[in]     :taskId - Thread handle.
 * Return osaStatus_Success if the task is destroied, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_TaskDestroy(osaTaskId_t taskId)
{
  task_handler_t handler;
  if(taskId == NULL)
  {
    return osaStatus_Error;
  }
  handler = (task_handler_t)taskId;
  
  /* Remove task control block from task list. */
  handler->prev->next = handler->next;
  handler->next->prev = handler->prev;
  
  /*
  * If current task is destroyed, then g_curTask will point to the previous
  * task, so that the subsequent tasks could be called. Check the function
  * OSA_Start for more details.
  */
  if (handler == g_curTask)
  {
    g_curTask = handler->prev;
  }
  
  /* Put task control block back to pool. */
  handler->prev = NULL;
  handler->next = g_freeTaskControlBlock;
  g_freeTaskControlBlock = handler;
  
  return osaStatus_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeInit
 * Description   : This function initializes the timer used in BM OSA, the
 * functions such as OSA_TimeDelay, OSA_TimeGetMsec, and the timeout are all
 * based on this timer.
 *
 *END**************************************************************************/
__WEAK_FUNC void OSA_TimeInit(void)
{
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    SysTick->CTRL &= ~(SysTick_CTRL_ENABLE_Msk);
    SysTick->LOAD = SystemCoreClock/1000 - 1;
    SysTick->VAL = 0;
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk | SysTick_CTRL_TICKINT_Msk | SysTick_CTRL_CLKSOURCE_Msk;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeDiff
 * Description   : This function gets the difference between two time stamp,
 * time overflow is considered.
 *
 *END**************************************************************************/
__WEAK_FUNC uint32_t OSA_TimeDiff(uint32_t time_start, uint32_t time_end)
{
    if (time_end >= time_start)
    {
        return time_end - time_start;
    }
    else
    {
        return FSL_OSA_TIME_RANGE - time_start + time_end + 1;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA__TimeDelay
 * Description   : This function is used to suspend the active thread for the given number of milliseconds.
 *
 *END**************************************************************************/
void OSA_TimeDelay(uint32_t millisec)
{
    uint32_t currTime, timeStart;
    
    timeStart = OSA_TimeGetMsec();
    
    do {
        currTime = OSA_TimeGetMsec(); /* Get current time stamp */
    } while (millisec >= OSA_TimeDiff(timeStart, currTime));
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_TimeGetMsec
 * Description   : This function gets current time in milliseconds.
 *
 *END**************************************************************************/
__WEAK_FUNC uint32_t OSA_TimeGetMsec(void)
{
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    return gTickCounter;
#else
    return 0;
#endif
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphoreCreate
 * Description   : This function is used to create a semaphore. 
 * Return         : Semaphore handle of the new semaphore, or NULL if failed. 
  *
 *END**************************************************************************/

osaSemaphoreId_t OSA_SemaphoreCreate(uint32_t initValue)
{
#if osNumberOfSemaphores
  osaSemaphoreId_t semId;
  osSemaphoreStruct_t* pSemStruct; 
  OSA_InterruptDisable();
  semId = pSemStruct = osObjectAlloc(&osSemaphoreInfo);
  OSA_InterruptEnable();
  if(semId == NULL)
  {
    return NULL;
  }
  
  pSemStruct->semaphore.semCount  = initValue;
  pSemStruct->semaphore.isWaiting = false;
  pSemStruct->semaphore.time_start = 0u;
  pSemStruct->semaphore.timeout = 0u;

  return semId;
#else 
  initValue=initValue;
  return NULL;
#endif  
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphoreDestroy
 * Description   : This function is used to destroy a semaphore.
 * Return        : osaStatus_Success if the semaphore is destroyed successfully, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_SemaphoreDestroy(osaSemaphoreId_t semId)
{
#if osNumberOfSemaphores
  if(osObjectIsAllocated(&osSemaphoreInfo, semId) == FALSE)
  {
    return osaStatus_Error;
  }
  OSA_InterruptDisable();
  osObjectFree(&osSemaphoreInfo, semId);
  OSA_InterruptEnable();
  return osaStatus_Success;  
#else
  semId=semId;
  return osaStatus_Error;
#endif  
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphoreWait
 * Description   : This function checks the semaphore's counting value, if it is
 * positive, decreases it and returns osaStatus_Success, otherwise, timeout
 * will be used for wait. The parameter timeout indicates how long should wait
 * in milliseconds. Pass osaWaitForever_c to wait indefinitely, pass 0 will
 * return osaStatus_Timeout immediately if semaphore is not positive.
 * This function returns osaStatus_Success if the semaphore is received, returns
 * osaStatus_Timeout if the semaphore is not received within the specified
 * 'timeout', returns osaStatus_Error if any errors occur during waiting.
 *
 *END**************************************************************************/
osaStatus_t OSA_SemaphoreWait(osaSemaphoreId_t semId, uint32_t millisec)
{
#if osNumberOfSemaphores
    osSemaphoreStruct_t* pSemStruct; 
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    uint32_t currentTime;
#endif  
  if(osObjectIsAllocated(&osSemaphoreInfo, semId) == FALSE)
  {
    return osaStatus_Error;
  }
  pSemStruct = (osSemaphoreStruct_t*)semId;
    /* Check the sem count first. Deal with timeout only if not already set */
    
    if (pSemStruct->semaphore.semCount)  
    {
        OSA_DisableIRQGlobal();
        pSemStruct->semaphore.semCount --;
        pSemStruct->semaphore.isWaiting = false;
        OSA_EnableIRQGlobal();
        return osaStatus_Success;
    }
    else
    {
        if (0 == millisec)
        {
            /* If timeout is 0 and semaphore is not available, return kStatus_OSA_Timeout. */
            return osaStatus_Timeout;
        }
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
        else if (pSemStruct->semaphore.isWaiting)
        {
            /* Check for timeout */
            currentTime = OSA_TimeGetMsec();
            if (pSemStruct->semaphore.timeout < OSA_TimeDiff(pSemStruct->semaphore.time_start, currentTime))
            {
                OSA_DisableIRQGlobal();
                pSemStruct->semaphore.isWaiting = false;
                OSA_EnableIRQGlobal();
                return osaStatus_Timeout;
            }
        }
        else if (millisec != osaWaitForever_c)    /* If don't wait forever, start the timer */
        {
            /* Start the timeout counter */
            OSA_DisableIRQGlobal();
            pSemStruct->semaphore.isWaiting = true;
            OSA_EnableIRQGlobal();
            pSemStruct->semaphore.time_start = OSA_TimeGetMsec();
            pSemStruct->semaphore.timeout = millisec;
        }
#endif
    }

    return osaStatus_Idle;
#else
  semId=semId; 
  millisec=millisec;
  return osaStatus_Error;
#endif  
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphorePost
 * Description   : This function is used to wake up one task that wating on the
 * semaphore. If no task is waiting, increase the semaphore. The function returns
 * osaStatus_Success if the semaphre is post successfully, otherwise returns
 * osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_SemaphorePost(osaSemaphoreId_t semId)
{
#if osNumberOfSemaphores
  osSemaphoreStruct_t* pSemStruct; 
  if(osObjectIsAllocated(&osSemaphoreInfo, semId) == FALSE)
  {
    return osaStatus_Error;
  }
  pSemStruct = (osSemaphoreStruct_t*)semId;  
  /* The max value is 0xFF */
  if (0xFF == pSemStruct->semaphore.semCount)
  {
    return osaStatus_Error;
  }
  OSA_DisableIRQGlobal();
  ++pSemStruct->semaphore.semCount;
  OSA_EnableIRQGlobal();
  
  return osaStatus_Success;
#else
  semId=semId;
  return osaStatus_Error;
#endif  
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexCreate
 * Description   : This function is used to create a mutex.
 * Return        : Mutex handle of the new mutex, or NULL if failed. 
 *
 *END**************************************************************************/
osaMutexId_t OSA_MutexCreate(void)
{
#if osNumberOfMutexes  
  osaMutexId_t mutexId;
  osMutexStruct_t* pMutexStruct; 
  OSA_InterruptDisable();
  mutexId = pMutexStruct = osObjectAlloc(&osMutexInfo);
  OSA_InterruptEnable();
  if(mutexId == NULL)
  {
    return NULL;
  }
  pMutexStruct->mutex.isLocked  = false;
  pMutexStruct->mutex.isWaiting = false;
  pMutexStruct->mutex.time_start = 0u;
  pMutexStruct->mutex.timeout = 0u;
  return mutexId;  
#else
  return NULL;
#endif  
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexLock
 * Description   : This function checks the mutex's status, if it is unlocked,
 * lock it and returns osaStatus_Success, otherwise, wait for the mutex.
 * MQX does not support timeout to wait for a mutex.
 * This function returns osaStatus_Success if the mutex is obtained, returns
 * osaStatus_Error if any errors occur during waiting. If the mutex has been
 * locked, pass 0 as timeout will return osaStatus_Timeout immediately.
 *
 *END**************************************************************************/
osaStatus_t OSA_MutexLock(osaMutexId_t mutexId, uint32_t millisec)
{
#if osNumberOfMutexes    
  osMutexStruct_t* pMutexStruct; 
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
  uint32_t currentTime;
#endif  
  if(osObjectIsAllocated(&osMutexInfo, mutexId) == FALSE)
  {
    return osaStatus_Error;
  }
  pMutexStruct = (osMutexStruct_t*)mutexId;
  
  /* Always check first. Deal with timeout only if not available. */
  if (pMutexStruct->mutex.isLocked == false)
  {
    /* Get the lock and return success */
    OSA_DisableIRQGlobal();
    pMutexStruct->mutex.isLocked = true;
    pMutexStruct->mutex.isWaiting = false;
    OSA_EnableIRQGlobal();
    return osaStatus_Success;
  }
  else
  {
    if (0 == millisec)
    {
      /* If timeout is 0 and mutex is not available, return kStatus_OSA_Timeout. */
      return osaStatus_Timeout;
    }
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    else if (pMutexStruct->mutex.isWaiting)
    {
      /* Check for timeout */
      currentTime = OSA_TimeGetMsec();
      if (pMutexStruct->mutex.timeout < OSA_TimeDiff(pMutexStruct->mutex.time_start, currentTime))
      {
        OSA_DisableIRQGlobal();
        pMutexStruct->mutex.isWaiting = false;
        OSA_EnableIRQGlobal();
        return osaStatus_Timeout;
      }
    }
    else if (millisec != osaWaitForever_c)    /* If dont't wait forever, start timer. */
    {
      /* Start the timeout counter */
      OSA_DisableIRQGlobal();
      pMutexStruct->mutex.isWaiting = true;
      OSA_EnableIRQGlobal();
      pMutexStruct->mutex.time_start = OSA_TimeGetMsec();
      pMutexStruct->mutex.timeout = millisec;
    }
#endif
  }
  
  return osaStatus_Idle;  
#else
  mutexId=mutexId;
  millisec=millisec;  
  return osaStatus_Error;
#endif  
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexUnlock
 * Description   : This function is used to unlock a mutex.
 *
 *END**************************************************************************/
osaStatus_t OSA_MutexUnlock(osaMutexId_t mutexId)
{
#if osNumberOfMutexes  
  osMutexStruct_t* pMutexStruct; 
  if(osObjectIsAllocated(&osMutexInfo, mutexId) == FALSE)
  {
    return osaStatus_Error;
  }
  pMutexStruct = (osMutexStruct_t*)mutexId;  
  OSA_DisableIRQGlobal();
  pMutexStruct->mutex.isLocked = false;
  OSA_EnableIRQGlobal();
  return osaStatus_Success;
#else
  mutexId=mutexId;
  return osaStatus_Error;  
#endif  
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexDestroy
 * Description   : This function is used to destroy a mutex.
 * Return        : osaStatus_Success if the lock object is destroyed successfully, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_MutexDestroy(osaMutexId_t mutexId)
{
#if osNumberOfMutexes    
  if(osObjectIsAllocated(&osMutexInfo, mutexId) == FALSE)
  {
    return osaStatus_Error;
  }
  OSA_InterruptDisable();
  osObjectFree(&osMutexInfo, mutexId);
  OSA_InterruptEnable();
  
  return osaStatus_Success;
#else
  mutexId=mutexId;
  return osaStatus_Error;    
#endif  
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventCreate
 * Description   : This function is used to create a event object.
 * Return        : Event handle of the new event, or NULL if failed. 
 *
 *END**************************************************************************/
osaEventId_t OSA_EventCreate(bool_t autoClear)
{
#if osNumberOfEvents  
  osaEventId_t eventId;
  osEventStruct_t* pEventStruct; 
  OSA_InterruptDisable();
  eventId = pEventStruct = osObjectAlloc(&osEventInfo);
  OSA_InterruptEnable();
  if(eventId == NULL)
  {
    return NULL;
  }
  pEventStruct->event.isWaiting = false;
  pEventStruct->event.flags     = 0;
  pEventStruct->event.autoClear = autoClear;
  pEventStruct->event.time_start = 0u;
  pEventStruct->event.timeout = 0u;
  pEventStruct->event.waitingTask = NULL;    
  return eventId;   
#else
  (void)autoClear;
  return NULL;
#endif  
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventSet
 * Description   : Set one or more event flags of an event object.
 * Return        : osaStatus_Success if set successfully, osaStatus_Error if failed.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventSet(osaEventId_t eventId, osaEventFlags_t flagsToSet)
{
#if osNumberOfEvents    
  osEventStruct_t* pEventStruct; 
  if(osObjectIsAllocated(&osEventInfo, eventId) == FALSE)
  {
    return osaStatus_Error;
  }
  pEventStruct = (osEventStruct_t*)eventId;  
  /* Set flags ensuring atomic operation */
  OSA_DisableIRQGlobal();
  pEventStruct->event.flags |= flagsToSet;
  if (pEventStruct->event.waitingTask != NULL)
  {
    pEventStruct->event.waitingTask->haveToRun = true;
  }
  OSA_EnableIRQGlobal();
  
  return osaStatus_Success;
#else
  (void)eventId;
  (void)flagsToSet;  
  return osaStatus_Error;
#endif  
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventClear
 * Description   : Clear one or more event flags of an event object.
 * Return        :osaStatus_Success if clear successfully, osaStatus_Error if failed.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventClear(osaEventId_t eventId, osaEventFlags_t flagsToClear)
{
#if osNumberOfEvents      
  osEventStruct_t* pEventStruct; 
  if(osObjectIsAllocated(&osEventInfo, eventId) == FALSE)
  {
    return osaStatus_Error;
  }
  pEventStruct = (osEventStruct_t*)eventId;  
  /* Clear flags ensuring atomic operation */
  OSA_DisableIRQGlobal();
  pEventStruct->event.flags &= ~flagsToClear;
  if (pEventStruct->event.flags != 0x00)
  {
    if (pEventStruct->event.waitingTask != NULL)
    {
      pEventStruct->event.waitingTask->haveToRun = true;
    }
  }
  OSA_EnableIRQGlobal();
  
  return osaStatus_Success;  
#else
  (void)eventId;
  (void)flagsToClear;  
  return osaStatus_Error;
#endif  
}
/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventWait
 * Description   : This function checks the event's status, if it meets the wait
 * condition, return osaStatus_Success, otherwise, timeout will be used for
 * wait. The parameter timeout indicates how long should wait in milliseconds.
 * Pass osaWaitForever_c to wait indefinitely, pass 0 will return the value
 * osaStatus_Timeout immediately if wait condition is not met. The event flags
 * will be cleared if the event is auto clear mode. Flags that wakeup waiting
 * task could be obtained from the parameter setFlags.
 * This function returns osaStatus_Success if wait condition is met, returns
 * osaStatus_Timeout if wait condition is not met within the specified
 * 'timeout', returns osaStatus_Error if any errors occur during waiting.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventWait(osaEventId_t eventId, osaEventFlags_t flagsToWait, bool_t waitAll, uint32_t millisec, osaEventFlags_t *pSetFlags)
{
#if osNumberOfEvents  
    osEventStruct_t* pEventStruct; 
#if (FSL_OSA_BM_TIMER_CONFIG != FSL_OSA_BM_TIMER_NONE)
    uint32_t currentTime;
#endif  
    osaStatus_t retVal = osaStatus_Idle;
    if(pSetFlags == NULL)
    {
        return osaStatus_Error;
    }
    if(osObjectIsAllocated(&osEventInfo, eventId) == FALSE)
    {
        return osaStatus_Error;
    }
    pEventStruct = (osEventStruct_t*)eventId;  
    
    OSA_DisableIRQGlobal();
#if (TASK_MAX_NUM > 0)
    pEventStruct->event.waitingTask = OSA_TaskGetId();
#endif
    
    *pSetFlags = pEventStruct->event.flags & flagsToWait;
    
